package com.data;

public class TextHelpWindow {
    //   --- Часто задаваемые вопросы ---
    public static final String QUESTION_ONE_TEXT = "Основные различия затрагивают три аспекта. Первый аспект — местоположение. " +
                               "Бра крепятся на стену, создавая акцентную подсветку, тогда как люстры располагаются под потолком," +
                               " становясь центральным элементом комнаты. Потолочные светильники, в свою очередь, монтируются прямо на потолок, " +
                               "обеспечивая равномерное освещение. Второй аспект — назначение. Бра чаще используются для локальной подсветки: " +
                               "например, возле зеркал или картин. Люстры выполняют двойную роль: они дают основной свет и служат декоративным элементом. " +
                               "Потолочные светильники ориентированы на практичность, освещая пространство без лишних деталей. Третий аспект — дизайн. " +
                               "Бра отличаются разнообразием: от винтажных моделей до современных минималистичных форм. Люстры обычно сложнее по конструкции: " +
                               "хрустальные подвески, кованые элементы или художественные плафоны. Потолочные светильники, как правило, лаконичны: плоские " +
                               "панели, встроенные споты или простые круглые плафоны. Если вы планируете установку, наши специалисты готовы помочь — оставьте " +
                               "заявку в разделе «Электротехнические работы», чтобы освещение в вашем доме стало идеальным.";

    public static final String QUESTION_TWO_TEXT = "Установка стиральной и сушильной машин в колонну — отличный способ " +
                               "сэкономить пространство в ванной комнате. Убедитесь, что выбранные вами стиральная и сушильная " +
                               "машины подходят друг другу по размерам и характеристикам. Многие производители выпускают " +
                               "специальные комплекты для установки в колонну, поэтому лучше выбирать устройства одного бренда и " +
                               "серии. В установке Вам помогут наши специалисты – оставьте заявку в разделе «Домашний мастер»";

    public static final String QUESTION_THREE_TEXT = "Все параметры стен и окон уже есть в базе. Не надо делать замеры, вы " +
                               "просто оставляете заявку, с Вами связывается менеджер и сообщает цену девайсов. Подобранные " +
                               "для жителей СберСити электрокарнизы подходят для интеграции в систему «Умный дом» в вашей квартире. " +
                               "Вы сможете управлять шторами через приложение в телефоне или голосом через любой девайс, " +
                               "где есть цифровой помощник Салют. Можно использовать готовый сценарий, который настроит наш " +
                               "специалист: шторы будут открываться и закрываться по определённому расписанию. Вам останется лишь " +
                               "выбрать ткань для своих штор.";
    public static final String QUESTION_THREE_TEXT_TWO = "Оставить заявку Вы сможете в разделе «Дооснащение квартиры».";

    public static final String QUESTION_FORE_TEXT = "Оставьте заявку в разделе «Сантехнические услуги». Всё – диспоузер установлен. " +
                               "Стандартный монтаж измельчителя специалисты управляющей компании выполнят бесплатно в обмен на Ваш сертификат.";

    //   --- О приложении ---
    public static final String MANUAL_FILE = "Руководство пользователя";
    public static final String AGREEMENT_FILE = "Согласие на обработку ПД";
}
